In [1]:
import pandas as pd

In [3]:
df_one = pd.DataFrame({
    'k1': ['A','A','B','B','C', 'C'],
    'col1': [100, 200, 300,300, 400, 500],
    'col2': ['NY', 'CA', 'WA', 'WA', 'AK', 'NV']
})
df_one

  k1  col1 col2
0  A   100   NY
1  A   200   CA
2  B   300   WA
3  B   300   WA
4  C   400   AK
5  C   500   NV

In [6]:
df_one['col2'].unique()

array(['NY', 'CA', 'WA', 'AK', 'NV'], dtype=object)

In [7]:
df_one['col2'].nunique()

5

In [12]:
df_one['k1'].unique()

array(['A', 'B', 'C'], dtype=object)

In [11]:
df_one['k1'].nunique()

3

In [13]:
df_one['col2'].value_counts()

WA    2
AK    1
NV    1
NY    1
CA    1
Name: col2, dtype: int64

In [14]:
df_one.drop_duplicates()

  k1  col1 col2
0  A   100   NY
1  A   200   CA
2  B   300   WA
4  C   400   AK
5  C   500   NV

In [17]:
df_one['NEW'] = df_one['col1'] * 10
df_one

  k1  col1 col2   NEW
0  A   100   NY  1000
1  A   200   CA  2000
2  B   300   WA  3000
3  B   300   WA  3000
4  C   400   AK  4000
5  C   500   NV  5000

In [18]:
def grab_first_letter(state):
    return state[0]

In [19]:
grab_first_letter('NY')

'N'

In [21]:
df_one['first letter'] = df_one['col2'].apply(grab_first_letter)
df_one

  k1  col1 col2   NEW first letter
0  A   100   NY  1000            N
1  A   200   CA  2000            C
2  B   300   WA  3000            W
3  B   300   WA  3000            W
4  C   400   AK  4000            A
5  C   500   NV  5000            N

In [25]:
def complex_letter(state):
    if state[0] == 'W':
        return 'Washington'
    else:
        return 'Error'

In [26]:
df_one['col2'].apply(complex_letter)

0         Error
1         Error
2    Washington
3    Washington
4         Error
5         Error
Name: col2, dtype: object

In [27]:
my_map = {'A':1, 'B': 2, 'C':3}

In [29]:
df_one['num'] = df_one['k1'].map(my_map)
df_one

  k1  col1 col2   NEW first letter  num
0  A   100   NY  1000            N    1
1  A   200   CA  2000            C    1
2  B   300   WA  3000            W    2
3  B   300   WA  3000            W    2
4  C   400   AK  4000            A    3
5  C   500   NV  5000            N    3

In [30]:
df_one['col1'].max()

500

In [31]:
df_one['col1'].idxmax()

5

In [33]:
df_one['col1'].min()

100

In [34]:
df_one['col1'].idxmin()

0

In [35]:
df_one.columns

Index(['k1', 'col1', 'col2', 'NEW', 'first letter', 'num'], dtype='object')

In [37]:
df_one.columns = ['C1', 'C2', 'C3', 'C4', 'C5', 'C6']
df_one

  C1   C2  C3    C4 C5  C6
0  A  100  NY  1000  N   1
1  A  200  CA  2000  C   1
2  B  300  WA  3000  W   2
3  B  300  WA  3000  W   2
4  C  400  AK  4000  A   3
5  C  500  NV  5000  N   3

In [39]:
df_one.sort_values('C3')

  C1   C2  C3    C4 C5  C6
4  C  400  AK  4000  A   3
1  A  200  CA  2000  C   1
5  C  500  NV  5000  N   3
0  A  100  NY  1000  N   1
2  B  300  WA  3000  W   2
3  B  300  WA  3000  W   2

In [41]:
df_one.sort_values('C3', ascending=False)

  C1   C2  C3    C4 C5  C6
2  B  300  WA  3000  W   2
3  B  300  WA  3000  W   2
0  A  100  NY  1000  N   1
5  C  500  NV  5000  N   3
1  A  200  CA  2000  C   1
4  C  400  AK  4000  A   3

In [44]:
features = pd.DataFrame({
    'A': [100, 200, 300, 400, 500],
    'B': [12, 13, 14, 15 ,16]
})
features

     A   B
0  100  12
1  200  13
2  300  14
3  400  15
4  500  16

In [45]:
predictions = pd.DataFrame({
    'pred': [0,1,1,0,1]
})
predictions

   pred
0     0
1     1
2     1
3     0
4     1

In [46]:
pd.concat([features,predictions], axis=1) # NOTE: Join along the correct axis

     A   B  pred
0  100  12     0
1  200  13     1
2  300  14     1
3  400  15     0
4  500  16     1

In [47]:
df_one['C1']

0    A
1    A
2    B
3    B
4    C
5    C
Name: C1, dtype: object

In [48]:
pd.get_dummies(df_one['C1']) # One-hot encoding

   A  B  C
0  1  0  0
1  1  0  0
2  0  1  0
3  0  1  0
4  0  0  1
5  0  0  1